''' '''
# 打印下面的图形，要求一次只能打印一个"*"，写循环嵌套
# 3行5列
'''
*****
*****
*****
'''
i = 1
while i <= 3:  # 行

    j = 1
    while j <= 5:  # 列
        print('*', end='')
        j += 1

    i += 1

    print()

print()
# 打印下面图形，要求一次只能打印一个"*"
'''
*
**
***
****
*****
'''

i = 1
while i <= 5:

    j = 1
    while j <= i:
        print('*', end='')
        j += 1
    print()

    i += 1


print()
# 打印一个等腰三角形, 要求一次只能打印一个"*"
'''          i   空格数量     *的数量
    *        1     4(=5-i)     1(=2*i-1)
   ***       2     3           3
  *****      3     2           5 
 *******     4     1           7
*********    5     0           9
'''

i = 1
while i <= 5:

    # 空格
    p = 1
    while p <= 5-i:
        print(' ', end='')
        p += 1

    # *号的数量
    j = 1
    while j <= 2*i-1:
        print('*', end='')
        j += 1
    print()

    i += 1


