''''''
# 7. 打印以下图形：
'''
*****
*****
*****
*****
*****
*****
'''
for i in range(6):
    for j in range(5):
        print('*', end='')
    print()


print()
# 8. 打印以下图形：
'''
*
**
***
****
*****
******
'''
for i in range(6):  # 0,1,2,3,4,5
    for j in range(i+1):
        print('*', end='')
    print()


print()
# 打印图形
'''
1
12
123
1234
12345
123456
'''
for i in range(6):  # 0,1,2,3,4,5
    for j in range(i+1):
        print(f'{j+1}', end='')
    print()


#

# 6. 打印99乘法表
'''
1*1=1	
1*2=2	2*2=4	
1*3=3	2*3=6	3*3=9	
1*4=4	2*4=8	3*4=12	4*4=16	
1*5=5	2*5=10	3*5=15	4*5=20	5*5=25	
1*6=6	2*6=12	3*6=18	4*6=24	5*6=30	6*6=36	
1*7=7	2*7=14	3*7=21	4*7=28	5*7=35	6*7=42	7*7=49	
1*8=8	2*8=16	3*8=24	4*8=32	5*8=40	6*8=48	7*8=56	8*8=64	
1*9=9	2*9=18	3*9=27	4*9=36	5*9=45	6*9=54	7*9=63	8*9=72	9*9=81	
'''
# \n : 换行符
# \t : 制表符 tab
for i in range(1, 10):
    for j in range(1, i+1):
        print(f'{j}*{i}={i*j}', end='\t')
    print()


# 练习: for打印下面的等腰三角形
# 打印一个等腰三角形, 要求一次只能打印一个"*"
'''           i   空格数量     *的数量
     *        1     5(=6-i)     1(=2*i-1)
    ***       2     4           3
   *****      3     3           5 
  *******     4     2           7
 *********    5     1           9
***********   6     0           11
'''

for i in range(1, 7):
    for p in range(6-i):
        print(' ', end='')
    for j in range(2*i-1):
        print('*', end='')
    print()
