

# 1: 请输入一个月份,判断这个月份有多少天(不考虑闰年)
#  提示： month in [1,3,5,7,8,10,12]

# bigMonths = [1,3,5,7,8,10,12]
# r = input("请输入月份:")
# m=0
# try:
#     m = int(r)
# except ValueError:
#     print(f"输入的字符{r}不正确")
#
# if m<1 or m>12:
#     print(f"输入的月份{m}无效")
# if int(r) in bigMonths:
#     print( f"{r}月 31天")
# else:
#     print(f"{r}月是 30天")

# 2:根据输入的年纪判断是否"成年"或"未成年",
#      如果年龄不在 正常范围内(0<=age<=150)则输出"这不是人!"



# 3: 根据输入的成绩打印"及格" 或 "不及格"




# 4: 输入2个整数a和b,如果a-b的结果是奇数,则输出该结果,否则输出"a-b的结果不是奇数"
#  判断奇数： (a-b) % 2 == 1
a = input("请输入整数 a=")
b = input("请输入整数 b=")
if (int(a) -int(b))%2 ==1:
    print(f"{a}-{b}的结果是奇数！")
else:
    print(f"{a}-{b}的结果是奇数！")


# 5.从控制台输入一个三位数，如果是水仙花数就打印“是水仙花数”，否则打印“不是水仙花数”
# 该数的每一位的立方和等于自身的值,比如:153 = 1**3 + 5**3 + 3**3


# 6.从控制台输入一个五位数，如果是回文数就打印“是回文数”，否则打印“不是回文数”
#  回文数: 对称的5位数
# 	例如：11111   12321   12221



# 7,判断一个年份是闰年还是平年；
#  （1.能被4整除而不能被100整除.（如2024年就是闰年,1800年不是.）
#    2.能被400整除.（如2000年是闰年））



# 8. 开发一款软件，根据公式（身高-108）*2=标准体重，可以有10斤左右的浮动。
#    来观察测试者体重是否合适, 输入真实身高(cm)，真实体重(斤)
#  输入用户的真实体重和真实身高
'''
height = int(input('请输入您的身高：'))
weight = int(input('请输入您的体重：'))
'''

height = int(input('请输入您的身高：'))
weight = int(input('请输入您的体重：'))



