
# 1. 已知深中通道长度为24KM，小军驾驶的雷米汽车 从大桥深圳端开始平均时速100km/h的速度行驶,  求需要多久可以达到中山？
print(240%100, end='\t')
for i in range(1 ,1000):
    print(i%5, end='\t')

# 2. 已知从深圳到长沙的总距离是800KM，其中高速有700KM，城市路段有100KM，
#     高速最快可120km/h速度行驶，城市道路最快60km/h行驶, 求最快多久可以到达目的地？


# 3. 华氏温度转摄氏温度
#  【提示：将华氏温度转换为摄氏温度(F是华氏温度)  F = 1.8C + 32】


# 4, 小红刚入职一家企业月薪10K，合同期3年，老板同意每年给他涨幅入职薪水的20%，
#       问合同到期后小红的工资是多少？此时老板催促续签合同，如果你是小红 是否会继续待在公司?


# 5, 为抵抗洪水，战士连续作战89小时，编程计算共多少天零多少小时？


# 6, 给定一个5位数，分别把这个数字的万位，千位，百位、十位、个位算出来并显示。如： 12345
#    提示： 可以使用运算符整除// 和 求余%





